#!/usr/bin/python3

# Задание 2 - Переменные INT и FLOAT
# В Python используется динамическая типизация.
# Интерпретатор по значению переменной сам определяет ее тип.

print('2. Переменные INT и FLOAT')
i, f = 7, 3.14
print('Int: {}\nFloat: {}\n'.format(i, f))
